{
  "application": {
    "title": "Microservices"
  },
  "languages": {
    "german": "Deutsch",
    "english": "English"
  },
  "navigation": {
    "home": "Startseite",
    "imprint": "Impressum",
    "github": "Github",
    "chess": "Schach",
    "buymeacoffee": "Spende einen Kaffee"
  },
  "owner": {
    "name": "Michael Baumberger",
    "address": "Birchli 14",
    "city": "8840 Einsiedeln",
    "country": "Schweiz",
    "email": "michael_baumberger@gmx.ch"
  },
  "imprint": {
    "title": "Impressum",
    "contact-address-title": "Kontakt-Adresse",
    "email-title": "E-Mail:",
    "disclaimer-of-liability-title": "Haftungsausschluss",
    "disclaimer-of-liability-1": "Der Autor übernimmt keinerlei Gewähr hinsichtlich der inhaltlichen Richtigkeit, Genauigkeit, Aktualität, Zuverlässigkeit und Vollständigkeit der Informationen.",
    "disclaimer-of-liability-2": "Haftungsansprüche gegen den Autor wegen Schäden materieller oder immaterieller Art, welche aus dem Zugriff oder der Nutzung bzw. Nichtnutzung der veröffentlichten Informationen, durch Missbrauch der Verbindung oder durch technische Störungen entstanden sind, werden ausgeschlossen.",
    "disclaimer-of-liability-3": "Alle Angebote sind unverbindlich. Der Autor behält es sich ausdrücklich vor, Teile der Seiten oder das gesamte Angebot ohne besondere Ankündigung zu verändern, zu ergänzen, zu löschen oder die Veröffentlichung zeitweise oder endgültig einzustellen.",
    "disclaimer-of-liability-for-links-title": "Haftungsausschluss für Links",
    "disclaimer-of-liability-for-links": "Verweise und Links auf Webseiten Dritter liegen ausserhalb unseres Verantwortungsbereichs. Es wird jegliche Verantwortung für solche Webseiten abgelehnt. Der Zugriff und die Nutzung solcher Webseiten erfolgen auf eigene Gefahr des jeweiligen Nutzers.",
    "copyrights-title": "Urheberrechte",
    "copyrights": "Die Urheber- und alle anderen Rechte an Inhalten, Bildern, Fotos oder anderen Dateien auf dieser Website, gehören ausschliesslich dem oben genannten Besitzer oder den speziell genannten Rechteinhabern. Für die Reproduktion jeglicher Elemente ist die schriftliche Zustimmung des Urheberrechtsträgers im Voraus einzuholen.",
    "source-title": "Quelle:",
    "source": "SwissAnwalt",
    "translation-title": "Übersetzung",
    "translation-description": "Diese Applikation/Webseite wurde auf Deutsch geschrieben. Alle anderen Sprachen, welche zur Verfügung stehen wurden nicht von Menschen übersetzt und können deswegen Übersetzungsfehler beinhalten."
  },
  "home": {
    "title": "Startseite"
  },
  "chess": {
    "title": "Schach"
  },
  "login": {
    "title": "Login"
  }
}
