{
    "about-me": {
        "beyond-coding": {
            "s1": "Obwohl das Programmieren meine größte Leidenschaft ist, interessiere ich mich auch sehr für Softwarearchitektur, IT-Sicherheit und Teammanagement. Das Entwerfen robuster und skalierbarer Systeme begeistert mich ebenso wie die Implementierung von Best Practices zur Sicherheit, um Anwendungen vor Schwachstellen zu schützen. Darüber hinaus lerne ich gerne etwas über effektive Teamzusammenarbeit und wie man eine produktive und motivierende Entwicklungsumgebung schafft.",
            "s2": "Ich erweitere mein Wissen ständig, indem ich Bücher über Softwareentwicklung, Architektur und Sicherheit lese. Mittlerweile besitze ich etwa 30 technische Bücher, die Themen von Designmustern über Clean-Code-Prinzipien bis hin zu verteilten Systemen abdecken. Es macht mir wirklich Spaß, über die neuesten Technologietrends auf dem Laufenden zu bleiben.",
            "title": "Über das Codieren hinaus"
        },
        "customer-project": {
            "s1": "Sie haben eine Idee für eine Website oder Webanwendung, wissen aber nicht, wo Sie anfangen sollen? Oder vielleicht braucht Ihr bestehendes Projekt Verbesserungen, eine bessere Leistung oder ein neues Design? Ich kann Ihnen helfen!",
            "s2": "Mit meiner Erfahrung in der Backend- und Frontend-Entwicklung erstelle ich moderne, sichere und skalierbare Anwendungen, die auf Ihre Bedürfnisse zugeschnitten sind. Ob es sich um eine Business-Website, eine benutzerdefinierte Web-App oder ein internes Tool handelt, ich konzentriere mich auf saubere Architektur, Wartbarkeit und Leistung.",
            "s3": "Ich arbeite hauptsächlich mit Java, Kotlin und Spring Boot für die Backend-Entwicklung und Angular für Frontend-Anwendungen. Aber ich wähle immer die besten Technologien für den Job aus und stelle sicher, dass Ihr Projekt mit Blick auf Skalierbarkeit, Sicherheit und langfristige Wartbarkeit erstellt wird.",
            "s4": "Wenn Sie interessiert sind, nehmen Sie gerne Kontakt mit mir auf und lassen Sie uns besprechen, wie ich Ihre Idee zum Leben erwecken kann!",
            "title": "Sie benötigen eine Website oder Webanwendung?"
        },
        "experience": {
            "experience": "Erfahrung",
            "intro": "Hier ist eine Liste mit meinen Erfahrungen.",
            "platforms-and-tools": "Plattformen & Tools",
            "programming-languages-and-databases": "Programmiersprachen & Datenbanken",
            "rating": "Bewertung (über mich selbst)",
            "softskills": "Soziale Kompetenzen",
            "years": "Jahre"
        },
        "introduction": {
            "s1": "Hallo! Mein Name ist Michael Baumberger. Ich bin ein leidenschaftlicher Softwareentwickler aus der Schweiz mit einem starken Hintergrund in Webentwicklung und Backend-Engineering. Meine Reise in die Welt der IT begann mit einer Ausbildung bei Würth ITensis von 2017 bis 2021, wo ich praktische Erfahrung im Erstellen, Warten und Optimieren von Softwarelösungen sammelte. Nach Abschluss meiner Ausbildung arbeitete ich dort bis 2024 weiter, verfeinerte meine Fähigkeiten weiter und arbeitete an verschiedenen Projekten."
        },
        "lets-contact": {
            "s1": "Wenn Sie an einer Zusammenarbeit interessiert sind oder einfach nur über Softwareentwicklung, Architektur oder Sicherheit chatten möchten, können Sie sich gerne an mich wenden! Ich bin immer offen für neue Herausforderungen, Kooperationen und interessante Diskussionen.",
            "title": "Lass uns vernetzen!"
        },
        "meta-description": "Lernen Sie Michael Baumberger kennen, einen engagierten Softwareentwickler mit Schwerpunkt in Webentwicklung und Backend-Engineering. Erfahren Sie mehr über seinen Werdegang, seine Erfolge und seine Leidenschaft für den Aufbau robuster und sicherer Anwendungen.",
        "passion": {
            "s1": "Programmieren ist nicht nur mein Job, sondern meine Leidenschaft. Ich erkunde ständig neue Technologien, verbessere meine Fähigkeiten und arbeite an Nebenprojekten. Im Laufe der Jahre habe ich eine tiefe Wertschätzung für clean Code, gut strukturierte Architekturen und sichere Anwendungen entwickelt.",
            "s2": "Im Backend arbeite ich hauptsächlich mit Java, Kotlin und dem Spring Framework, das ich in professionellen Umgebungen ausgiebig verwendet habe. Für meine persönlichen Projekte bevorzuge ich Kotlin, da mir seine prägnante Syntax, Nullsicherheit und funktionalen Programmierfunktionen gefallen. Ich habe auch Erfahrung mit Spring Boot, Spring Cloud und Microservice-Architekturen und stelle sicher, dass Anwendungen skalierbar und einfach zu warten sind.",
            "s3": "Im Frontend habe ich mit einer Vielzahl von Technologien gearbeitet, darunter Angular, HTML, CSS, JSP, JavaScript und Knockout.js. Mein derzeitiges Frontend-Framework der Wahl ist Angular, oft kombiniert mit PrimeNG für eine moderne Benutzeroberfläche. Während ich mich mehr auf die Backend-Entwicklung konzentriere, versuche ich immer, eine nahtlose Verbindung zwischen Frontend und Backend herzustellen, um ein großartiges Benutzererlebnis zu gewährleisten.",
            "title": "Meine Leidenschaft für Entwicklung"
        },
        "title": "Über mich",
        "title-with-name": "Über mich - Michael Baumberger"
    },
    "application": {
        "title": "Microservices"
    },
    "chess": {
        "account": {
            "name": "Name",
            "platform": "Plattform",
            "size": "Anz."
        },
        "event": {
            "account": "Account",
            "birthday": "Geburtstag",
            "chess-com": "Chess.com",
            "date-from": "Von",
            "date-to": "Bis",
            "details": "Details",
            "federation": "Verband",
            "games": "Partien",
            "location": "Standort",
            "meta-description": "Tauchen Sie in die spannenden Details von {eventName} ein, welches vom {{from}} bis am {{to}} in {{location}} stattfindet, bei dem erstklassige Partien und Wettkämpfe präsentiert werden. Informieren Sie sich über Zeitpläne, Teilnehmer und Highlights für ein fesselndes Schacherlebnis.",
            "open-account": "Account öffnen",
            "open-official-website": "Offizielle Webseite öffnen",
            "organizer": "Veranstalter",
            "participant": {
                "firstname": "Vorname",
                "lastname": "Nachname"
            },
            "participants": "Teilnehmer",
            "sort": {
                "birthday": "Geburtstag",
                "federation": "Verband",
                "firstname": "Vorname",
                "lastname": "Nachname"
            },
            "tab-title": "{{title}} - MichiBaum",
            "title": "{{title}}"
        },
        "events": {
            "meta-description": "Informieren Sie sich über bevorstehende Schachturniere, Klubtreffen und Ausstellungen für Spieler aller Spielstärken. Knüpfen Sie Kontakte, lernen Sie neue Strategien und tauchen Sie in den Wettkampfaspekt des Schachs ein.",
            "tab-title": "Schach Veranstaltungen",
            "title": "Schach Veranstaltungen"
        },
        "home": {
            "popular-openings": "Beliebte Eröffnungen",
            "recent-upcoming": "Vergangene, laufende und zukünftige Veranstaltungen",
            "start-openings": "Start Eröffnungen",
            "to-all-events": "Zu allen Veranstaltungen"
        },
        "meta-description": "Tauchen Sie in die strategische Welt des Schachs ein und verbessern Sie Ihre Fähigkeiten gegen vielfältige Gegner. Entdecken Sie Turniere, spannende Eröffnungen, Taktiken und die Geschichte hinter diesem zeitlosen Spiel.",
        "navigation": {
            "all-events": "Alle Veranstaltungen",
            "events": "Veranstaltungen",
            "home": "Startseite",
            "news": "News",
            "openings": "Eröffnungen",
            "person": "Person",
            "player-analysis": "Player Analysis",
            "popular-openings": "Beliebte Eröffnungen",
            "settings": "Einstellungen",
            "start-openings": "Start Eröffnungen"
        },
        "news": {
            "meta-description": "Bleiben Sie auf dem Laufenden mit den neuesten Schachnachrichten, von wichtigen Turnieren bis hin zu bemerkenswerten Spielerleistungen. Erhalten Sie kurze Zusammenfassungen und ausführliche Berichte über internationale Ereignisse.",
            "tab-title": "Schach Neuigkeiten - MichiBaum",
            "title": "Schach Neuigkeiten"
        },
        "opening": {
            "engine-evaluation": "{{engine}}({{version}}) bewertete {{evaluation}} in Tiefe {{depth}}",
            "tree-depth": "Baumtiefe: "
        },
        "openings": {
            "meta-description": "Entdecken Sie eine Vielzahl verschiedener Schacheröffnungen, die jeweils eigene Stärken und Strategien bieten. Verbessern Sie Ihr Spiel durch das Erlernen neuer Taktiken und den Ausbau Ihres Eröffnungsrepertoires.",
            "tab-title": "Eröffnungen - MichiBaum",
            "title": "Eröffnungen"
        },
        "platform": {
            "CHESSCOM": "Chess.com",
            "FIDE": "Fide",
            "FREESTYLE": "Freestyle",
            "LICHESS": "Lichess"
        },
        "player": {
            "firstname": "Vorname",
            "lastname": "Nachname",
            "search-person": "Person suchen"
        },
        "tab-title": "Schach - MichiBaum",
        "title": "Schach"
    },
    "chess-settings": {
        "title": "Schach Einstellungen"
    },
    "donate": {
        "buy-me-a-coffee": "Spende einen Kaffee",
        "hosttech": "Zu Hosttech",
        "meta-description": "Helfen Sie mir, weiterhin wertvolle Inhalte bereitzustellen, indem Sie mein Engagement unterstützen. Jeder Beitrag zählt und fördert Wachstum sowie eine bessere Nutzererfahrung.",
        "s1": "👋 Hallo! Ich bin begeistert, diese Website 🌐 zu erstellen, und setze mich dafür ein, hochwertige Inhalte 📚 und ein nahtloses Erlebnis zu bieten. Um alles reibungslos am Laufen zu halten, arbeite ich etwa 30 Stunden pro Woche 🕒 an Verbesserungen, neuen Funktionen und Wartung. Außerdem kostet die Wartung des Servers etwa 70 CHF pro Monat 💰.",
        "s2": "💡 Wenn dir die Website gefallen hat oder sie dir hilfreich war, kannst du meine Arbeit gerne unterstützen 🤝. Deine Unterstützung hilft, die Kosten zu decken und ermöglicht es mir, noch mehr Zeit in den Aufbau und die Weiterentwicklung der Seite zu investieren 🛠️.",
        "s3": "🌟 Wenn du selbst einen zuverlässigen Server suchst, empfehle ich Hosttech. Verwende meinen Promo-Code 31886957, um mit deren Dienstleistungen zu starten 🚀.",
        "s4": "🙏 Vielen Dank für deine Unterstützung und dafür, dass du Teil dieser Reise bist! 🌈",
        "tab-title": "Spenden - MichiBaum",
        "title": "Spenden"
    },
    "fitness": {
        "title": "Fitness"
    },
    "fitness-settings": {
        "title": "Fitness Einstellungen"
    },
    "general": {
        "sort": "Sortieren"
    },
    "home": {
        "about-me": {
            "button": "Zu über mich",
            "content": "Wer ist der Entwickler dieser Plattform? Lerne mehr über mich!",
            "title": "About me"
        },
        "chess": {
            "button": "Zu Schach",
            "content": "Schach ist interessant. Statistiken über Schachspieler is umso interessanter",
            "title": "Schach"
        },
        "donate": {
            "button": "Zu Spenden",
            "content": "Magst du die Webseite? Denke darüber nach mir einen Kaffee zu spenden.",
            "title": "Spenden"
        },
        "fitness": {
            "button": "Zu Fitness",
            "content": "Fitness und Statistiken zusammen? Wooooowww!!",
            "title": "Fitness"
        },
        "login": {
            "button": "Zum Login",
            "content": "Du willst mehr Inhalt sehen? Melde dich an!",
            "title": "Anmelden"
        },
        "meta-description": "Entdecken Sie auf unserer Startseite die neuesten Aktualisierungen und Funktionen. Tauchen Sie ein in eine Vielzahl von Inhalten, von persönlichen Projekten bis hin zu Community-Einblicken.",
        "music": {
            "button": "Zu Musik",
            "content": "Musik spricht, was Worte nicht können, berührt Herzen grenzenlos.",
            "title": "Musik"
        },
        "tab-title": "Startseite - MichiBaum",
        "title": "Startseite"
    },
    "imprint": {
        "contact-address-title": "Kontakt-Adresse",
        "copyrights": "Die Urheber- und alle anderen Rechte an Inhalten, Bildern, Fotos oder anderen Dateien auf dieser Website, gehören ausschliesslich dem oben genannten Besitzer oder den speziell genannten Rechteinhabern. Für die Reproduktion jeglicher Elemente ist die schriftliche Zustimmung des Urheberrechtsträgers im Voraus einzuholen.",
        "copyrights-title": "Urheberrechte",
        "disclaimer-of-liability-1": "Der Autor übernimmt keinerlei Gewähr hinsichtlich der inhaltlichen Richtigkeit, Genauigkeit, Aktualität, Zuverlässigkeit und Vollständigkeit der Informationen.",
        "disclaimer-of-liability-2": "Haftungsansprüche gegen den Autor wegen Schäden materieller oder immaterieller Art, welche aus dem Zugriff oder der Nutzung bzw. Nichtnutzung der veröffentlichten Informationen, durch Missbrauch der Verbindung oder durch technische Störungen entstanden sind, werden ausgeschlossen.",
        "disclaimer-of-liability-3": "Alle Angebote sind unverbindlich. Der Autor behält es sich ausdrücklich vor, Teile der Seiten oder das gesamte Angebot ohne besondere Ankündigung zu verändern, zu ergänzen, zu löschen oder die Veröffentlichung zeitweise oder endgültig einzustellen.",
        "disclaimer-of-liability-for-links": "Verweise und Links auf Webseiten Dritter liegen ausserhalb unseres Verantwortungsbereichs. Es wird jegliche Verantwortung für solche Webseiten abgelehnt. Der Zugriff und die Nutzung solcher Webseiten erfolgen auf eigene Gefahr des jeweiligen Nutzers.",
        "disclaimer-of-liability-for-links-title": "Haftungsausschluss für Links",
        "disclaimer-of-liability-title": "Haftungsausschluss",
        "email-title": "E-Mail:",
        "google-analytics": "Diese Website benutzt Google Analytics, einen Webanalysedienst der Google LLC (Google). Google Analytics verwendet Cookies. Die durch den Cookie erzeugten Informationen über Ihre Benutzung dieser Website werden in der Regel an einen Server von Google übertragen und dort gespeichert. Im Auftrag des Betreibers dieser Website wird Google diese Informationen benutzen, um Ihre Nutzung der Website auszuwerten, um Reports über die Websiteaktivitäten zusammenzustellen und um weitere mit der Websitenutzung und der Internetnutzung verbundene Dienstleistungen gegenüber dem Websitebetreiber zu erbringen.",
        "google-analytics-title": "Google Analytics",
        "hosting-provider": "Diese Website wird von der hosttech GmbH, Richterswil, Schweiz, gehostet.",
        "hosting-provider-title": "Hosting-Anbieter",
        "meta-description": "Hier finden Sie wichtige rechtliche Hinweise und Kontaktinformationen zu dieser Website. Erfahren Sie, wie wir Ihre Daten schützen und geltende Vorschriften einhalten.",
        "tab-title": "Impressum - MichiBaum",
        "title": "Impressum",
        "translation-description": "Diese Applikation/Webseite wurde auf Deutsch geschrieben. Alle anderen Sprachen, welche zur Verfügung stehen wurden nicht von Menschen übersetzt und können deswegen Übersetzungsfehler beinhalten.",
        "translation-title": "Übersetzung"
    },
    "languages": {
        "chinese": "中文",
        "english": "English",
        "german": "Deutsch",
        "spanish": "Español"
    },
    "login": {
        "login": "Anmelden",
        "meta-description": "Greifen Sie sicher auf Ihr Konto zu und verwalten Sie bequem Ihre persönlichen Einstellungen. Freuen Sie sich auf einen unkomplizierten Anmeldevorgang für eine nahtlose Nutzererfahrung.",
        "password": "Passwort",
        "register": "Zum Registrieren",
        "tab-title": "Anmelden - MichiBaum",
        "title": "Anmelden",
        "username": "Benutzername"
    },
    "microservices": {
        "meta-description": "Entdecken Sie unseren modularen Ansatz zur Entwicklung flexibler und skalierbarer Anwendungen mit Microservices. Erfahren Sie, wie einzelne Dienste zuverlässig miteinander kommunizieren und gleichzeitig eine hohe Leistungsfähigkeit beibehalten.",
        "tab-title": "Microservices - MichiBaum",
        "title": "Microservices"
    },
    "music": {
        "title": "Musik"
    },
    "music-settings": {
        "title": "Musik Einstellungen"
    },
    "navigation": {
        "apps": "Apps",
        "developer-and-project": "Entwickler & Projekt",
        "else": "Anderes",
        "github": "Github",
        "light-dark-mode": "Hell-/Dunkelmodus",
        "navigation": "Navigation",
        "settings": "Einstellungen"
    },
    "owner": {
        "address": "Birchli 14",
        "city": "8840 Einsiedeln",
        "country": "Schweiz",
        "email": "admin@michibaum.ch",
        "name": "Michael Baumberger"
    },
    "register": {
        "email": "E-Mail",
        "error": {
            "details": "Möglicherweise ist der Benutzername oder die E-Mail bereits vergeben.",
            "summary": "Registrierung fehlgeschlagen"
        },
        "login": "Zum Anmelden",
        "meta-description": "Erstellen Sie ein neues Konto, um erweiterte Funktionen freizuschalten und unserer wachsenden Community beizutreten. Die Registrierung ist schnell, benutzerfreundlich und vollkommen kostenlos.",
        "password": "Passwort",
        "register": "Registrieren",
        "success": {
            "details": "Sie können sich nun anmelden.",
            "summary": "Registrierung erfolgreich"
        },
        "tab-title": "Registrieren - MichiBaum",
        "title": "Registrieren",
        "username": "Benutzername"
    },
    "sw-update": {
        "later": "Später",
        "update": "Update",
        "update-available": "Update verfügbar!",
        "update-available-message": "Eine neue Version ist verfügbar!"
    }
}
