{
    "about-me": {
        "beyond-coding": {
            "s1": "While coding is my main passion, I’m also deeply interested in software architecture, IT security, and team management. Designing robust and scalable systems excites me just as much as implementing security best practices to protect applications from vulnerabilities. Additionally, I enjoy learning about effective team collaboration and how to create a productive and motivating development environment.",
            "s2": "I continuously expand my knowledge by reading books on software development, architecture, and security. At this point, I own around 30 technical books, covering topics from design patterns to clean code principles and distributed systems. Staying up-to-date with the latest trends in technology is something I truly enjoy.",
            "title": "Beyond Coding"
        },
        "customer-project": {
            "s1": "Do you have an idea for a website or web application but don’t know where to start? Or maybe your existing project needs improvements, better performance, or a fresh design? I can help!",
            "s2": "With my experience in backend and frontend development, I create modern, secure, and scalable applications tailored to your needs. Whether it’s a business website, a custom web app, or an internal tool, I focus on clean architecture, maintainability, and performance.",
            "s3": "I primarily work with Java, Kotlin and Spring Boot for backend development and Angular for frontend applications. But I always choose the best technologies for the job, ensuring your project is built with scalability, security, and long-term maintainability in mind.",
            "s4": "If you’re interested, feel free to get in touch, and let’s discuss how I can bring your idea to life!",
            "title": "Need a Website or Web Application?"
        },
        "experience": {
            "experience": "Experience",
            "intro": "Here you see a List of my experiences.",
            "platforms-and-tools": "Platforms & tools",
            "programming-languages-and-databases": "Programming Languages & Databases",
            "rating": "Rating (about myself)",
            "softskills": "Softskills",
            "years": "Years"
        },
        "introduction": {
            "s1": "Hello! My Name is Michael Baumberger. I’m a passionate software developer from Switzerland with a strong background in web development and backend engineering. My journey in the world of IT started with an apprenticeship at Würth ITensis from 2017 to 2021, where I gained hands-on experience in building, maintaining, and optimizing software solutions. After completing my apprenticeship, I continued working there until 2024, further refining my skills and working on various projects."
        },
        "lets-contact": {
            "s1": "If you’re interested in working together or just want to chat about software development, architecture, or security, feel free to reach out! I’m always open to new challenges, collaborations, and interesting discussions.",
            "title": "Let’s Connect!"
        },
        "meta-description": "Get to know Michael Baumberger, a committed software developer with a background in web development and backend engineering. Discover his journey, achievements, and passion for building robust and secure applications.",
        "passion": {
            "s1": "Programming isn’t just my job — it’s what I love doing. I’m constantly exploring new technologies, improving my skills, and working on side projects. Over the years, I’ve developed a deep appreciation for clean code, well-structured architectures, and secure applications.",
            "s2": "On the backend, I primarily work with Java, Kotlin and the Spring Framework, which I have used extensively in professional settings. For my personal projects, I prefer Kotlin, as I enjoy its concise syntax, null safety, and functional programming capabilities. I also have experience working with Spring Boot, Spring Cloud, and microservice architectures, ensuring that applications are scalable and easy to maintain.",
            "s3": "On the frontend, I have worked with a variety of technologies, including Angular, HTML, CSS, JSP, JavaScript, and Knockout.js. My current frontend framework of choice is Angular, often combined with PrimeNG for a modern UI. While I focus more on backend development, I always aim to create a seamless connection between frontend and backend, ensuring a great user experience.",
            "title": "My Passion for Development"
        },
        "title": "About me",
        "title-with-name": "About me - Michael Baumberger"
    },
    "application": {
        "title": "Microservices"
    },
    "chess": {
        "account": {
            "name": "Name",
            "platform": "Platform",
            "size": "Size"
        },
        "event": {
            "account": "Account",
            "birthday": "Birthday",
            "chess-com": "Chess.com",
            "date-from": "From",
            "date-to": "Until",
            "details": "Details",
            "federation": "Federation",
            "games": "Games",
            "location": "Location",
            "meta-description": "Dive into the exciting details of {{title}} running from {{from}} until {{to}} in {{location}}, a chess event showcasing top-tier matches and competitions. Check out schedules, participants, and highlights for a truly captivating experience.",
            "open-account": "Open account",
            "open-official-website": "Open official website",
            "organizer": "Organizer",
            "participant": {
                "firstname": "Firstname",
                "lastname": "Lastname"
            },
            "participants": "Participants",
            "sort": {
                "birthday": "Birthday",
                "federation": "Federation",
                "firstname": "Firstname",
                "lastname": "Lastname"
            },
            "tab-title": "{{title}} - MichiBaum",
            "title": "{{title}}"
        },
        "events": {
            "meta-description": "Explore upcoming chess tournaments, club meetups, and exhibitions open to fans of every level. Connect with fellow enthusiasts, learn new strategies, and immerse yourself in competitive play.",
            "tab-title": "Chess Events",
            "title": "Chess Events"
        },
        "home": {
            "recent-upcoming": "Recent, running and upcoming Events",
            "start-openings": "Start Openings",
            "to-all-events": "To all events"
        },
        "meta-description": "Immerse yourself in the strategic world of chess and hone your skills against diverse opponents. Explore tournaments, fascinating openings, tactics, and the history behind this timeless game.",
        "navigation": {
            "all-events": "All Events",
            "events": "Events",
            "home": "Home",
            "news": "News",
            "openings": "Openings",
            "person": "Person",
            "player-analysis": "Player Analysis",
            "settings": "Settings",
            "start-openings": "Start Openings"
        },
        "news": {
            "meta-description": "Stay informed with the latest chess news, from major tournaments to remarkable player accomplishments. Get quick highlights and in-depth coverage of events happening worldwide.",
            "tab-title": "Chess News - MichiBaum",
            "title": "Chess News"
        },
        "opening": {
            "tree-depth": "Tree depth: "
        },
        "openings": {
            "meta-description": "Uncover a wide range of chess openings, each with unique strengths and strategies. Enhance your gameplay by mastering new tactics and expanding your opening repertoire.",
            "tab-title": "Openings - MichiBaum",
            "title": "Openings"
        },
        "platform": {
            "CHESSCOM": "Chess.com",
            "FIDE": "Fide",
            "FREESTYLE": "Freestyle",
            "LICHESS": "Lichess"
        },
        "player": {
            "firstname": "Firstname",
            "lastname": "Lastname",
            "search-person": "Search Person"
        },
        "tab-title": "Chess - MichiBaum",
        "title": "Chess"
    },
    "chess-settings": {
        "title": "Chess Settings"
    },
    "donate": {
        "buy-me-a-coffee": "Buy me a coffee",
        "hosttech": "Go to Hosttech",
        "meta-description": "Help me continue providing valuable content by supporting my efforts. Every contribution makes a difference, driving growth and improving user experiences.",
        "s1": "👋 Hello! I’m passionate about creating this website 🌐 and am committed to delivering high-quality content 📚 and a seamless experience. To keep everything running smoothly, I spend around 30 hours each week 🕒 working on improvements, features, and maintenance. Additionally, maintaining the server costs about 70 CHF per month 💰.",
        "s2": "💡 If you’ve enjoyed the website or found it helpful, consider supporting my work 🤝. Your sponsorship helps cover the costs and allows me to dedicate even more time to building and refining the site 🛠️.",
        "s3": "🌟 And if you’re looking for a reliable server yourself, I recommend Hosttech. Use my promo code 31886957 to get started with their services 🚀.",
        "s4": "🙏 Thank you for your support and for being part of this journey! 🌈",
        "tab-title": "Donate - MichiBaum",
        "title": "Donate"
    },
    "fitness": {
        "title": "Fitness"
    },
    "fitness-settings": {
        "title": "Fitness Settings"
    },
    "general": {
        "sort": "Sort"
    },
    "home": {
        "about-me": {
            "button": "Go to about me",
            "content": "Who is the developer of this platform? Learn more about me!",
            "title": "About me"
        },
        "chess": {
            "button": "Go to chess",
            "content": "Chess is interesting. Statistics about chess player is even more interesting.",
            "title": "Chess"
        },
        "donate": {
            "button": "Go to donations",
            "content": "Do you like the website? Think about donating me a coffee.",
            "title": "Donate"
        },
        "fitness": {
            "button": "Go to fitness",
            "content": "Fitness and statistics together? Wooooowww!!",
            "title": "Fitness"
        },
        "login": {
            "button": "Go to login",
            "content": "Wanna see more content? Login or Register!",
            "title": "Login"
        },
        "meta-description": "Explore our website’s main page for the latest updates and features. Dive into a variety of content ranging from personal projects to community insights.",
        "music": {
            "button": "Go to music",
            "content": "Music speaks what words cannot, touching hearts beyond measure.",
            "title": "Music"
        },
        "tab-title": "Home - MichiBaum",
        "title": "Home"
    },
    "imprint": {
        "contact-address-title": "Contact address",
        "copyrights": "The copyrights and all other rights to content, images, photos or other files on this website belong exclusively to the above-mentioned owner or the specifically named rights holder. The written consent of the copyright holder must be obtained in advance for the reproduction of any elements.",
        "copyrights-title": "Copyrights",
        "disclaimer-of-liability-1": "The author assumes no liability for the correctness, accuracy, timeliness, reliability and completeness of the information.",
        "disclaimer-of-liability-2": "Liability claims against the author due to material or immaterial damage resulting from the access or use or non-use of the published information, misuse of the connection or technical faults are excluded.",
        "disclaimer-of-liability-3": "All offers are non-binding. The author expressly reserves the right to change, supplement or delete parts of the pages or the entire offer without special announcement or to temporarily or permanently cease publication.",
        "disclaimer-of-liability-for-links": "References and links to third party websites are outside our area of responsibility. It rejected any responsibility for such websites. Accessing and using such websites is at the user's own risk.",
        "disclaimer-of-liability-for-links-title": "Disclaimer of liability for links",
        "disclaimer-of-liability-title": "Disclaimer of liability",
        "email-title": "E-mail:",
        "meta-description": "Find essential legal details and contact information for this website here. Learn how we protect your data and uphold relevant regulations.",
        "tab-title": "Imprint - MichiBaum",
        "title": "Imprint",
        "translation-description": "This application/website was written in German. All other languages that are available have not been translated by humans and may therefore contain translation errors.",
        "translation-title": "Translation"
    },
    "languages": {
        "english": "English",
        "german": "Deutsch"
    },
    "login": {
        "login": "Login",
        "meta-description": "Access your account securely and manage your personal settings with ease. Enjoy a straightforward sign-in process designed for seamless navigation.",
        "password": "Password",
        "register": "Go to register",
        "tab-title": "Login - MichiBaum",
        "title": "Login",
        "username": "Username"
    },
    "microservices": {
        "meta-description": "Discover our modular approach to building flexible, scalable applications using microservices. Learn how individual services communicate seamlessly while maintaining robust performance.",
        "tab-title": "Microservices - MichiBaum",
        "title": "Microservices"
    },
    "music": {
        "title": "Music"
    },
    "music-settings": {
        "title": "Music Settings"
    },
    "navigation": {
        "apps": "Apps",
        "developer-and-project": "Developer & Project",
        "else": "Else",
        "github": "Github",
        "light-dark-mode": "Light/dark mode",
        "navigation": "Navigation",
        "settings": "Settings"
    },
    "owner": {
        "address": "Birchli 14",
        "city": "8840 Einsiedeln",
        "country": "Switzerland",
        "email": "admin@michibaum.ch",
        "name": "Michael Baumberger"
    },
    "register": {
        "email": "E-mail",
        "error": {
            "details": "The username or email may already be taken.",
            "summary": "Registration error"
        },
        "login": "Go to login",
        "meta-description": "Create a new account to unlock enhanced features and join our growing community. Registration is quick, intuitive, and completely free.",
        "password": "Password",
        "register": "Register",
        "success": {
            "details": "You can log in now.",
            "summary": "Registration successful"
        },
        "tab-title": "Register - MichiBaum",
        "title": "Register",
        "username": "Username"
    },
    "sw-update": {
        "later": "Later",
        "update": "Update",
        "update-available": "Update available!",
        "update-available-message": "A new version is available!"
    }
}
