{
  "language": {
    "english": "Englisch",
    "german": "Deutsch"
  },
  "application": {
    "title": "Lifemanagement",
    "nav": "Navigation"
  },
  "general": {
    "search": "Suchen",
    "save": "Speichern",
    "available": "Verfügbar",
    "selected": "Ausgewählt",
    "translation-title": "Übersetzung",
    "translation-description": "Diese Applikation/Webseite wurde auf Deutsch geschrieben. Alle anderen Sprachen, welche zur Verfügung stehen wurden nicht von Menschen übersetzt und können deswegen Übersetzungsfehler beinhalten."
  },
  "navigation": {
    "usersettings": "Benutzereinstellungen",
    "usermanagement": "Benutzermanagement",
    "logout": "Abmelden",
    "logs": "Logs",
    "home": "Home",
    "imprint": "Impressum",
    "privacy-policy": "Datenschutzbestimmungen",
    "github": "Github",
    "frontend_documentation": "Frontend Dokumentation",
    "backend_api": "Backend Api"
  },
  "login": {
    "username": "Benutzername",
    "password": "Passwort",
    "login": "Anmelden"
  },
  "error": {
    "auth": {
      "failed": "Anmeldung fehlgeschlagen"
    },
    "cached": {
      "summary": "Zwischengespeicherte Daten",
      "detail": "Die Daten, welche angezeigt werden, wurden zwischengespeichert und sind vielleicht nicht mehr aktuell"
    },
    "400": {
      "name": "Fehlerhafte Anfrage",
      "message": "Die Anfrage-Nachricht war fehlerhaft aufgebaut."
    },
    "401": {
      "name": "Authentifizierung fehlgeschlagen",
      "message": "Die Authentifizierung ist fehlgeschlagen."
    },
    "500": {
      "name": "Serverseitiger Fehler",
      "message": "Serverseitiger Fehler"
    },
    "noConnection": {
      "name": "keine Verbindung",
      "message": "keine Verbindung"
    },
    "403": {
      "name": "Verboten",
      "message": "Die Anfrage wurde mangels Berechtigung des Clients nicht durchgeführt, bspw. Weil der authentifizierte Benutzer nicht berechtigt ist, oder eine als HTTPS konfigurierte URL nur mit HTTP aufgerufen wurde."
    },
    "404": {
      "name": "Nicht gefunden",
      "message": "Die angeforderte Ressource wurde nicht gefunden. Dieser Statuscode kann ebenfalls verwendet werden, um eine Anfrage ohne näheren Grund abzuweisen."
    },
    "405": {
      "name": "Methode nicht erlaubt",
      "message": "Die Anfrage darf nur mit anderen HTTP-Methoden gestellt werden."
    }
  },
  "permission": {
    "USER_MANAGEMENT": "Benutzermanagement",
    "SEE_LOGS": "Logs sehen",
    "ADMIN": "Admin",
    "DEVELOP_TOOLS": "Entwicklungswerkzeuge"
  },
  "log": {
    "id": "ID",
    "date": "Datum",
    "formattedMessage": "Formatierte Nachricht",
    "loggerName": "Loggername",
    "level": "Level",
    "threadName": "Threadname",
    "arg0": "Argument 0",
    "arg1": "Argument 1",
    "arg2": "Argument 2",
    "arg3": "Argument 3",
    "callerFilename": "Dateiname",
    "callerClass": "Klass",
    "callerMethod": "Methode",
    "callerLine": "Zeile",
    "seen": "Gesehen",
    "chooseLevels": "Level auswählen",
    "chooseColumns": "Spalten auswählen",
    "severalLevelsSelected": "verschiedene Levels ausgewählt",
    "severalColumnsSelected": "verschiedene Spalten ausgewählt",
    "filter": "Filter"
  },
  "user": {
    "id": "ID",
    "user": "Benutzer",
    "name": "Name",
    "dateFormat": "Datumsformat",
    "emailAddress": "Email Addresse",
    "disabled": "Inaktiv",
    "enabled": "Aktiv",
    "lastLogin": "zuletzt Angemeldet",
    "newPassword": "neues Passwort",
    "updateSuccessfully": "Benutzer update erfolgreich",
    "updateFailed": "Benutzer update fehlgeschlagen",
    "selectOne": "Wähle einen Benutzer",
    "permissions": "Berechtigungen"
  },
  "dateFormat": {
    "short": "Kurz",
    "medium": "Mittel",
    "long": "Lang",
    "full": "Voll",
    "shortDate": "kurzes Datum",
    "mediumDate": "mittleres Datum",
    "longDate": "langes Datum",
    "fullDate": "volles Datum",
    "shortTime": "kurze Zeit",
    "mediumTime": "mittlere Zeit",
    "longTime": "lange Zeit",
    "fullTime": "volle Zeit"
  },
  "help": {
    "help": "Hilfe",
    "doesntExist": "Keine Hilfe vorhanden"
  },
  "impress": {
    "contact-address-title": "Kontakt-Adresse",
    "email-title": "E-Mail:",
    "disclaimer-of-liability-title": "Haftungsausschluss",
    "disclaimer-of-liability-1": "Der Autor übernimmt keinerlei Gewähr hinsichtlich der inhaltlichen Richtigkeit, Genauigkeit, Aktualität, Zuverlässigkeit und Vollständigkeit der Informationen.",
    "disclaimer-of-liability-2": "Haftungsansprüche gegen den Autor wegen Schäden materieller oder immaterieller Art, welche aus dem Zugriff oder der Nutzung bzw. Nichtnutzung der veröffentlichten Informationen, durch Missbrauch der Verbindung oder durch technische Störungen entstanden sind, werden ausgeschlossen.",
    "disclaimer-of-liability-3": "Alle Angebote sind unverbindlich. Der Autor behält es sich ausdrücklich vor, Teile der Seiten oder das gesamte Angebot ohne besondere Ankündigung zu verändern, zu ergänzen, zu löschen oder die Veröffentlichung zeitweise oder endgültig einzustellen.",
    "disclaimer-of-liability-for-links-title": "Haftungsausschluss für Links",
    "disclaimer-of-liability-for-links": "Verweise und Links auf Webseiten Dritter liegen ausserhalb unseres Verantwortungsbereichs. Es wird jegliche Verantwortung für solche Webseiten abgelehnt. Der Zugriff und die Nutzung solcher Webseiten erfolgen auf eigene Gefahr des jeweiligen Nutzers.",
    "copyrights-title": "Urheberrechte",
    "copyrights": "Die Urheber- und alle anderen Rechte an Inhalten, Bildern, Fotos oder anderen Dateien auf dieser Website, gehören ausschliesslich dem oben genannten Besitzer oder den speziell genannten Rechteinhabern. Für die Reproduktion jeglicher Elemente ist die schriftliche Zustimmung des Urheberrechtsträgers im Voraus einzuholen.",
    "source-title": "Quelle:",
    "source": "SwissAnwalt"
  },
  "owner": {
    "name": "Michael Baumberger",
    "address": "Via Calundis, 39",
    "city": "7013 Domat/Ems",
    "country": "Schweiz",
    "email": "michael_baumberger@gmx.ch",
    "phone": "079 154 27 71",
    "domain": "https://michibaum.ch/"
  },
  "privacy-policy": {
    "privacy-policy": "Datenschutzerklärung",
    "responsible-spot": "Verantwortliche Stelle im Sinne der Datenschutzgesetze, insbesondere der EU-Datenschutzgrundverordnung (DSGVO), ist:",
    "phone": "Telefon:",
    "email": "E-Mail:",
    "website": "WebSite:",
    "general-information-title": "Allgemeiner Hinweis",
    "general-information-1": "Gestützt auf Artikel 13 der schweizerischen Bundesverfassung und den datenschutzrechtlichen Bestimmungen des Bundes (Datenschutzgesetz, DSG) hat jede Person Anspruch auf Schutz ihrer Privatsphäre sowie auf Schutz vor Missbrauch ihrer persönlichen Daten. Die Betreiber dieser Seiten nehmen den Schutz Ihrer persönlichen Daten sehr ernst. Wir behandeln Ihre personenbezogenen Daten vertraulich und entsprechend der gesetzlichen Datenschutzvorschriften sowie dieser Datenschutzerklärung.",
    "general-information-2": "In Zusammenarbeit mit unseren Hosting-Providern bemühen wir uns, die Datenbanken so gut wie möglich vor fremden Zugriffen, Verlusten, Missbrauch oder vor Fälschung zu schützen.",
    "general-information-3": "Wir weisen darauf hin, dass die Datenübertragung im Internet (z.B. bei der Kommunikation per E-Mail) Sicherheitslücken aufweisen kann. Ein lückenloser Schutz der Daten vor dem Zugriff durch Dritte ist nicht möglich.",
    "general-information-4": "Durch die Nutzung dieser Website erklären Sie sich mit der Erhebung, Verarbeitung und Nutzung von Daten gemäss der nachfolgenden Beschreibung einverstanden. Diese Website kann grundsätzlich ohne Registrierung besucht werden. Dabei werden Daten wie beispielsweise aufgerufene Seiten bzw. Namen der abgerufenen Datei, Datum und Uhrzeit zu statistischen Zwecken auf dem Server gespeichert, ohne dass diese Daten unmittelbar auf Ihre Person bezogen werden. Personenbezogene Daten, insbesondere Name, Adresse oder E-Mail-Adresse werden soweit möglich auf freiwilliger Basis erhoben. Ohne Ihre Einwilligung erfolgt keine Weitergabe der Daten an Dritte.",
    "processing-personal-data-title": "Bearbeitung von Personendaten",
    "processing-personal-data-1": "Personendaten sind alle Angaben, die sich auf eine bestimmte oder bestimmbare Person beziehen. Eine betroffene Person ist eine Person, über die Personendaten bearbeitet werden. Bearbeiten umfasst jeden Umgang mit Personendaten, unabhängig von den angewandten Mitteln und Verfahren, insbesondere das Aufbewahren, Bekanntgeben, Beschaffen, Löschen, Speichern, Verändern, Vernichten und Verwenden von Personendaten.",
    "processing-personal-data-2": "Wir bearbeiten Personendaten im Einklang mit dem schweizerischen Datenschutzrecht. Im übrigen bearbeiten wir – soweit und sofern die EU-DSGVO anwendbar ist – Personendaten gemäss folgenden Rechtsgrundlagen im Zusammenhang mit Art. 6 Abs. 1 DSGVO",
    "processing-personal-data-2-li1": "lit. a) Bearbeitung von Personendaten mit Einwilligung der betroffenen Person.",
    "processing-personal-data-2-li2": "lit. b) Bearbeitung von Personendaten zur Erfüllung eines Vertrages mit der betroffenen Person sowie zur Durchführung entsprechender vorvertraglicher Massnahmen.",
    "processing-personal-data-2-li3": "lit. c) Bearbeitung von Personendaten zur Erfüllung einer rechtlichen Verpflichtung, der wir gemäss allenfalls anwendbarem Recht der EU oder gemäss allenfalls anwendbarem Recht eines Landes, in dem die DSGVO ganz oder teilweise anwendbar ist, unterliegen.",
    "processing-personal-data-2-li4": "lit. d) Bearbeitung von Personendaten um lebenswichtige Interessen der betroffenen Person oder einer anderen natürlichen Person zu schützen.",
    "processing-personal-data-2-li5": "lit. f) Bearbeitung von Personendaten um die berechtigten Interessen von uns oder von Dritten zu wahren, sofern nicht die Grundfreiheiten und Grundrechte sowie Interessen der betroffenen Person überwiegen. Berechtigte Interessen sind insbesondere unser betriebswirtschaftliches Interesse, unsere Website bereitstellen zu können, die Informationssicherheit, die Durchsetzung von eigenen rechtlichen Ansprüchen und die Einhaltung von schweizerischem Recht.",
    "processing-personal-data-3": "Wir bearbeiten Personendaten für jene Dauer, die für den jeweiligen Zweck oder die jeweiligen Zwecke erforderlich ist. Bei länger dauernden Aufbewahrungspflichten aufgrund von gesetzlichen und sonstigen Pflichten, denen wir unterliegen, schränken wir die Bearbeitung entsprechend ein.",
    "cookies-title": "Datenschutzerklärung für Cookies",
    "cookies-1": "Diese Website verwendet Cookies. Das sind kleine Textdateien, die es möglich machen, auf dem Endgerät des Nutzers spezifische, auf den Nutzer bezogene Informationen zu speichern, während er die Website nutzt. Cookies ermöglichen es, insbesondere Nutzungshäufigkeit und Nutzeranzahl der Seiten zu ermitteln, Verhaltensweisen der Seitennutzung zu analysieren, aber auch unser Angebot kundenfreundlicher zu gestalten. Cookies bleiben über das Ende einer Browser-Sitzung gespeichert und können bei einem erneuten Seitenbesuch wieder aufgerufen werden. Wenn Sie das nicht wünschen, sollten Sie Ihren Internetbrowser so einstellen, dass er die Annahme von Cookies verweigert.",
    "cookies-2": "Ein genereller Widerspruch gegen den Einsatz der zu Zwecken des Onlinemarketing eingesetzten Cookies kann bei einer Vielzahl der Dienste, vor allem im Fall des Trackings, über die US-amerikanische Seite http://www.aboutads.info/choices/ oder die EU-Seite http://www.youronlinechoices.com/ erklärt werden. Des Weiteren kann die Speicherung von Cookies mittels deren Abschaltung in den Einstellungen des Browsers erreicht werden. Bitte beachten Sie, dass dann gegebenenfalls nicht alle Funktionen dieses Onlineangebotes genutzt werden können.",
    "ssl-tls-encryption-title": "Datenschutzerklärung für SSL-/TLS-Verschlüsselung",
    "ssl-tls-encryption-1": "Diese Website nutzt aus Gründen der Sicherheit und zum Schutz der übertragung vertraulicher Inhalte, wie zum Beispiel der Anfragen, die Sie an uns als Seitenbetreiber senden, eine SSL-/TLS-Verschlüsselung. Eine verschlüsselte Verbindung erkennen Sie daran, dass die Adresszeile des Browsers von 'http://' auf 'https://' wechselt und an dem Schloss-Symbol in Ihrer Browserzeile.",
    "ssl-tls-encryption-2": "Wenn die SSL bzw. TLS Verschlüsselung aktiviert ist, können die Daten, die Sie an uns übermitteln, nicht von Dritten mitgelesen werden.",
    "server-logs-title": "Datenschutzerklärung für Server-Log-Files",
    "server-logs-1": "Der Provider dieser Website erhebt und speichert automatisch Informationen in so genannten Server-Log Files, die Ihr Browser automatisch an uns übermittelt. Dies sind:",
    "server-logs-1-li1": "Browsertyp und Browserversion",
    "server-logs-1-li2": "verwendetes Betriebssystem",
    "server-logs-1-li3": "Referrer URL",
    "server-logs-1-li4": "Hostname des zugreifenden Rechners",
    "server-logs-1-li5": "Uhrzeit der Serveranfrage",
    "server-logs-2": "Diese Daten sind nicht bestimmten Personen zuordenbar. Eine Zusammenführung dieser Daten mit anderen Datenquellen wird nicht vorgenommen. Wir behalten uns vor, diese Daten nachträglich zuprüfen, wenn uns konkrete Anhaltspunkte für eine rechtswidrige Nutzung bekannt werden.",
    "contact-form-title": "Datenschutzerklärung für Kontaktformular",
    "contact-form-1": "Wenn Sie uns per Kontaktformular Anfragen zukommen lassen, werden Ihre Angaben aus dem Anfrageformular inklusive der von Ihnen dort angegebenen Kontaktdaten zwecks Bearbeitung der Anfrage und für den Fall von Anschlussfragen bei uns gespeichert. Diese Daten geben wir nicht ohne Ihre Einwilligung weiter.",
    "rights-data-subjects": {
      "title": "Rechte betroffener Personen",
      "right-confirmation-title": "Recht auf Bestätigung",
      "right-confirmation-1": "Jede betroffene Person hat das Recht, vom Betreiber der Website eine Bestätigung darüber zu verlangen, ob betroffene Personen betreffende, personenbezogene Daten verarbeitet werden. Möchten Sie dieses Bestätigungsrecht in Anspruch nehmen, können Sie sich hierzu jederzeit an den Datenschutzbeauftragten wenden.",
      "right-information-title": "Recht auf Auskunft",
      "right-information-1": "Jede von der Verarbeitung betroffene Person mit personenbezogenen Daten hat das Recht, jederzeit vom Betreiber dieser Website unentgeltliche Auskunft über die zu seiner Person gespeicherten personenbezogenen Daten und eine Kopie dieser Auskunft zu erhalten. Ferner kann gegebenenfalls über folgende Informationen Auskunft gegeben werden:",
      "right-information-1-li1": "die Verarbeitungszwecke",
      "right-information-1-li2": "die Kategorien personenbezogener Daten, die verarbeitet werden",
      "right-information-1-li3": "die Empfänger, gegenüber denen die personenbezogenen Daten offengelegt worden sind oder noch offengelegt werden",
      "right-information-1-li4": "falls möglich, die geplante Dauer, für die die personenbezogenen Daten gespeichert werden, oder, falls dies nicht möglich ist, die Kriterien für die Festlegung dieser Dauer",
      "right-information-1-li5": "das Bestehen eines Rechts auf Berichtigung oder Löschung der sie betreffenden personenbezogenen Daten oder auf Einschränkung der Verarbeitung durch den Verantwortlichen oder eines Widerspruchsrechts gegen diese Verarbeitung",
      "right-information-1-li6": "das Bestehen eines Beschwerderechts bei einer Aufsichtsbehörde",
      "right-information-1-li7": "wenn die personenbezogenen Daten nicht bei der betroffenen Person erhoben werden: Alle verfügbaren Informationen über die Herkunft der Daten",
      "right-information-2": "Ferner steht der betroffenen Person ein Auskunftsrecht darüber zu, ob personenbezogene Daten an ein Drittland oder an eine internationale Organisation übermittelt wurden. Sofern dies der Fall ist, so steht der betroffenen Person im übrigen das Recht zu, Auskunft über die geeigneten Garantien im Zusammenhang mit der übermittlung zu erhalten.",
      "right-information-3": "Möchten Sie dieses Auskunftsrecht in Anspruch nehmen, können Sie sich hierzu jederzeit an unseren Datenschutzbeauftragten wenden.",
      "right-rectification-title": "Recht auf Berichtigung",
      "right-rectification-1": "Jede von der Verarbeitung personenbezogener Daten betroffene Person hat das Recht, die unverzügliche Berichtigung sie betreffender unrichtiger personenbezogener Daten zu verlangen. Ferner steht der betroffenen Person das Recht zu, unter Berücksichtigung der Zwecke der Verarbeitung, die Vervollständigung unvollständiger personenbezogener Daten - auch mittels einer ergänzenden Erklärung - zu verlangen.",
      "right-rectification-2": "Möchten Sie dieses Berichtigungsrecht in Anspruch nehmen, können Sie sich hierzu jederzeit an unseren Datenschutzbeauftragten wenden.",
      "right-erasure-title": "Recht auf Löschung (Recht auf Vergessen werden)",
      "right-erasure-1": "Jede von der Verarbeitung personenbezogener Daten betroffene Person hat das Recht, von dem Verantwortlichen dieser Website zu verlangen, dass die sie betreffenden personenbezogenen Daten unverzüglich gelöscht werden, sofern einer der folgenden Gründe zutrifft und soweit die Verarbeitung nicht erforderlich ist:",
      "right-erasure-1-li1": "Die personenbezogenen Daten wurden für solche Zwecke erhoben oder auf sonstige Weise verarbeitet, für welche sie nicht mehr notwendig sind",
      "right-erasure-1-li2": "Die betroffene Person widerruft ihre Einwilligung, auf die sich die Verarbeitung stützte, und es fehlt an einer anderweitigen Rechtsgrundlage für die Verarbeitung",
      "right-erasure-1-li3": "Die betroffene Person legt aus Gründen, die sich aus ihrer besonderen Situation ergeben, Widerspruch gegen die Verarbeitung ein und es liegen keine vorrangigen berechtigten Gründe für die Verarbeitung vor, oder die betroffene Person legt im Falle von Direktwerbung und damit verbundenem Profiling Widerspruch gegen die Verarbeitung ein",
      "right-erasure-1-li4": "Die personenbezogenen Daten wurden unrechtmässig verarbeitet",
      "right-erasure-1-li5": "Die Löschung der personenbezogenen Daten ist zur Erfüllung einer rechtlichen Verpflichtung nach dem Unionsrecht oder dem Recht der Mitgliedstaaten erforderlich, dem der Verantwortliche unterliegt",
      "right-erasure-1-li6": "Die personenbezogenen Daten wurden in Bezug auf angebotene Dienste der Informationsgesellschaft, die einem Kind direkt gemacht wurden, erhoben",
      "right-erasure-2": "Sofern einer der oben genannten Gründe zutrifft und Sie die Löschung von personenbezogenen Daten, die beim Betreiber dieser Website gespeichert sind, veranlassen möchten, können Sie sich hierzu jederzeit an unseren Datenschutzbeauftragten wenden. Der Datenschutzbeauftragte dieser Website wird veranlassen, dass dem Löschverlangen unverzüglich nachgekommen wird.",
      "right-restriction-processing-title": "Recht auf Einschränkung der Verarbeitung",
      "right-restriction-processing-1": "Jede von der Verarbeitung personenbezogener Daten betroffene Person hat das Recht, von dem Verantwortlichen dieser Website die Einschränkung der Verarbeitung zu verlangen, wenn eine der folgenden Voraussetzungen gegeben ist:",
      "right-restriction-processing-1-li1": "Die Richtigkeit der personenbezogenen Daten wird von der betroffenen Person bestritten, und zwar für eine Dauer, die es dem Verantwortlichen ermöglicht, die Richtigkeit der personenbezogenen Daten zu überprüfen",
      "right-restriction-processing-1-li2": "Die Verarbeitung ist unrechtmässig, die betroffene Person lehnt die Löschung der personenbezogenen Daten ab und verlangt stattdessen die Einschränkung der Nutzung der personenbezogenen Daten",
      "right-restriction-processing-1-li3": "Der Verantwortliche benötigt die personenbezogenen Daten für die Zwecke der Verarbeitung nicht länger, die betroffene Person benötigt sie jedoch zur Geltendmachung, Ausübung oder Verteidigung von Rechtsansprüchen",
      "right-restriction-processing-1-li4": "Die betroffene Person hat aus Gründen, die sich aus ihrer besonderen Situation ergeben, Widerspruch gegen die Verarbeitung eingelegt und es steht noch nicht fest, ob die berechtigten Gründe des Verantwortlichen gegenüber denen der betroffenen Person überwiegen",
      "right-restriction-processing-2": "Sofern eine der oben genannten Voraussetzungen gegeben ist Sie die Einschränkung von personenbezogenen Daten, die beim Betreiber dieser Website gespeichert sind, verlangen möchten, können Sie sich hierzu jederzeit an unseren Datenschutzbeauftragten wenden. Der Datenschutzbeauftragte dieser Website wird die Einschränkung der Verarbeitung veranlassen.",
      "right-data-portability-title": "Recht auf Datenübertragbarkeit",
      "right-data-portability-1": "Jede von der Verarbeitung personenbezogener Daten betroffene Person hat das Recht, die sie betreffenden personenbezogenen Daten in einem strukturierten, gängigen und maschinenlesbaren Format zu erhalten. Sie hat ausserdem das Recht, dass diese Daten bei Vorliegen der gesetzlichen Voraussetzungen einem anderen Verantwortlichen übermittelt werden.",
      "right-data-portability-2": "Ferner hat die betroffene Person das Recht, zu erwirken, dass die personenbezogenen Daten direkt von einem Verantwortlichen an einen anderen Verantwortlichen übermittelt werden, soweit dies technisch machbar ist und sofern hiervon nicht die Rechte und Freiheiten anderer Personen beeinträchtigt werden.",
      "right-data-portability-3": "Zur Geltendmachung des Rechts auf Datenübertragbarkeit können Sie sich jederzeit an den vom Betreiber dieser Website bestellten Datenschutzbeauftragten wenden.",
      "right-object-title": "Recht auf Widerspruch",
      "right-object-1": "Jede von der Verarbeitung personenbezogener Daten betroffene Person hat das Recht, aus Gründen, die sich aus ihrer besonderen Situation ergeben, jederzeit gegen die Verarbeitung sie betreffender personenbezogener Daten, Widerspruch einzulegen.",
      "right-object-2": "Der Betreiber dieser Website verarbeitet die personenbezogenen Daten im Falle des Widerspruchs nicht mehr, es sei denn, wir können zwingende schutzwürdige Gründe für die Verarbeitung nachweisen, die den Interessen, Rechten und Freiheiten der betroffenen Person überwiegen, oder wenn die Verarbeitung der Geltendmachung, Ausübung oder Verteidigung von Rechtsansprüchen dient.",
      "right-object-3": "Zur Ausübung des Rechts auf Widerspruch können Sie sich direkt an den Datenschutzbeauftragten dieser Website wenden.",
      "right-withdraw-consent-under-data-protection-law-title": "Recht auf Widerruf einer datenschutzrechtlichen Einwilligung",
      "right-withdraw-consent-under-data-protection-law-1": "Jede von der Verarbeitung personenbezogener Daten betroffene Person hat das Recht, eine abgegebene Einwilligung zur Verarbeitung personenbezogener Daten jederzeit zu widerrufen.",
      "right-withdraw-consent-under-data-protection-law-2": "Möchten Sie Ihr Recht auf Widerruf einer Einwilligung geltend machen, können Sie sich hierzu jederzeit an unseren Datenschutzbeauftragten wenden."
    },
    "copyrights-title": "Urheberrechte",
    "copyrights-1": "Die Urheber- und alle anderen Rechte an Inhalten, Bildern, Fotos oder anderen Dateien auf der Website, gehören ausschliesslich dem Betreiber dieser Website oder den speziell genannten Rechteinhabern. Für die Reproduktion von sämtlichen Dateien, ist die schriftliche Zustimmung des Urheberrechtsträgers im Voraus einzuholen.",
    "copyrights-2": "Wer ohne Einwilligung des jeweiligen Rechteinhabers eine Urheberrechtsverletzung begeht, kann sich strafbar und allenfalls schadenersatzpflichtig machen.",
    "general-disclaimer-title": "Allgemeiner Haftungsausschluss",
    "general-disclaimer-1": "Alle Angaben unseres Internetangebotes wurden sorgfältig geprüft. Wir bemühen uns, unser Informationsangebot aktuell, inhaltlich richtig und vollständig anzubieten. Trotzdem kann das Auftreten von Fehlern nicht völlig ausgeschlossen werden, womit wir keine Garantie für Vollständigkeit, Richtigkeit und Aktualität von Informationen auch journalistisch-redaktioneller Art übernehmen können. Haftungsansprüche aus Schäden materieller oder ideeller Art, die durch die Nutzung der angebotenen Informationen verursacht wurden, sind ausgeschlossen, sofern kein nachweislich vorsätzliches oder grob fahrlässiges Verschulden vorliegt.",
    "general-disclaimer-2": "Der Herausgeber kann nach eigenem Ermessen und ohne Ankündigung Texte verändern oder löschen und ist nicht verpflichtet, Inhalte dieser Website zu aktualisieren. Die Benutzung bzw. der Zugang zu dieser Website geschieht auf eigene Gefahr des Besuchers. Der Herausgeber, seine Auftraggeber oder Partner sind nicht verantwortlich für Schäden, wie direkte, indirekte, zufällige, vorab konkret zu bestimmende oder Folgeschäden, die angeblich durch den Besuch dieser Website entstanden sind und übernehmen hierfür folglich keine Haftung.",
    "general-disclaimer-3": "Der Herausgeber übernimmt ebenfalls keine Verantwortung und Haftung für die Inhalte und die Verfügbarkeit von Website Dritter, die über externe Links dieser Website erreichbar sind. Für den Inhalt der verlinkten Seiten sind ausschliesslich deren Betreiber verantwortlich. Der Herausgeber distanziert sich damit ausdrücklich von allen Inhalten Dritter, die möglicherweise straf- oder haftungsrechtlich relevant sind oder gegen die guten Sitten verstossen.",
    "modifications-title": "Änderungen",
    "modifications-1": "Wir können diese Datenschutzerklärung jederzeit ohne Vorankündigung anpassen. Es gilt die jeweils aktuelle, auf unserer Website publizierte Fassung. Soweit die Datenschutzerklärung Teil einer Vereinbarung mit Ihnen ist, werden wir Sie im Falle einer Aktualisierung über die änderung per E-Mail oder auf andere geeignete Weise informieren.",
    "questions-data-protection-officer-title": "Fragen an den Datenschutzbeauftragten",
    "questions-data-protection-officer-1": "Wenn Sie Fragen zum Datenschutz haben, schreiben Sie uns bitte eine E-Mail oder wenden Sie sich direkt an die für den Datenschutz zu Beginn der Datenschutzerklärung aufgeführten, verantwortlichen Person.",
    "last-changed-date": "17.06.2020",
    "source-title": "Quelle:",
    "source": "SwissAnwalt"
  }
}
