{
  "language": {
    "english": "english",
    "german": "german"
  },
  "application": {
    "title": "Lifemanagement",
    "nav": "navigation"
  },
  "general": {
    "search": "search",
    "save": "save",
    "available": "available",
    "selected": "selected",
    "translation-title": "Translation",
    "translation-description": "This application / website was written in German. All other languages that are available have not been translated by humans and may therefore contain translation errors."
  },
  "navigation": {
    "usersettings": "usersettings",
    "usermanagement": "usermanagement",
    "logout": "logout",
    "logs": "logs",
    "home": "home",
    "imprint": "imprint",
    "privacy-policy": "privacy policy"
  },
  "login": {
    "username": "username",
    "password": "password",
    "login": "login"
  },
  "error": {
    "auth": {
      "failed": "authentication failed"
    },
    "cached": {
      "summary": "cached data",
      "detail": "The display data are cached and maybe not the latest"
    },
    "400": {
      "name": "Bad Request",
      "message": "The request message was erroneous."
    },
    "500": {
      "name": "Internal Server Error",
      "message": "Server side error"
    },
    "noConnection": {
      "name": "No Connection",
      "message": "No Connection"
    },
    "403": {
      "name": "Forbidden",
      "message": "The request was not carried out due to lack of authorization from the client, e.g. because the authenticated user is not authorized or a URL configured as HTTPS was only called up with HTTP."
    },
    "404": {
      "name": "Not Found",
      "message": "The requested resource was not found. This status code can also be used to reject a request for no reason."
    }
  },
  "permission": {
    "USER_MANAGEMENT": "usermanagement",
    "SEE_LOGS": "see logs",
    "ADMIN": "admin"
  },
  "log": {
    "id": "ID",
    "date": "date",
    "formattedMessage": "formatted message",
    "loggerName": "loggername",
    "level": "level",
    "threadName": "threadname",
    "arg0": "argument 0",
    "arg1": "argument 1",
    "arg2": "argument 2",
    "arg3": "argument 3",
    "callerFilename": "filename",
    "callerClass": "class",
    "callerMethod": "method",
    "callerLine": "line",
    "seen": "seen",
    "chooseLevels": "choose levels",
    "chooseColumns": "choose columns",
    "severalLevelsSelected": "several levels selected",
    "severalColumnsSelected": "several columns selected",
    "filter": "filter"
  },
  "user": {
    "id": "ID",
    "user": "user",
    "name": "name",
    "dateFormat": "dateformat",
    "emailAddress": "email address",
    "disabled": "inactive",
    "enabled": "active",
    "lastLogin": "last login",
    "newPassword": "new password",
    "updateSuccessfully": "user update successfully",
    "updateFailed": "Benutzer update failed",
    "selectOne": "select an user",
    "permissions": "permissions"
  },
  "dateFormat": {
    "short": "short",
    "medium": "medium",
    "long": "long",
    "full": "full",
    "shortDate": "short date",
    "mediumDate": "medium date",
    "longDate": "long date",
    "fullDate": "full date",
    "shortTime": "short time",
    "mediumTime": "medium time",
    "longTime": "long time",
    "fullTime": "full time"
  },
  "help": {
    "help": "help",
    "doesntExist": "No help exists"
  },
  "impress": {
    "contact-address-title": "Contact address",
    "email-title": "E-mail:",
    "disclaimer-of-liability-title": "Disclaimer of liability",
    "disclaimer-of-liability-1": "The author assumes no liability for the correctness, accuracy, timeliness, reliability and completeness of the information.",
    "disclaimer-of-liability-2": "Liability claims against the author due to material or immaterial damage resulting from the access or use or non-use of the published information, misuse of the connection or technical faults are excluded.",
    "disclaimer-of-liability-3": "All offers are non-binding. The author expressly reserves the right to change, supplement or delete parts of the pages or the entire offer without special announcement or to temporarily or permanently cease publication.",
    "disclaimer-of-liability-for-links-title": "Disclaimer of liability for links",
    "disclaimer-of-liability-for-links": "References and links to third party websites are outside our area of responsibility. It rejected any responsibility for such websites. Accessing and using such websites is at the user's own risk.",
    "copyrights-title": "Copyrights",
    "copyrights": "The copyrights and all other rights to content, images, photos or other files on this website belong exclusively to the above-mentioned owner or the specifically named rights holder. The written consent of the copyright holder must be obtained in advance for the reproduction of any elements.",
    "source-title": "Source:",
    "source": "SwissAnwalt"
  },
  "owner": {
    "name": "Michael Baumberger",
    "address": "Via Calundis, 39",
    "city": "7013 Domat/Ems",
    "country": "Switzerland",
    "email": "michael_baumberger@gmx.ch",
    "phone": "079 154 27 71",
    "domain": "https://michibaum.ch/"
  },
  "privacy-policy": {
    "privacy-policy": "Privacy Policy",
    "responsible-spot": "Responsible body in terms of data protection laws, in particular the EU General Data Protection Regulation (GDPR), is:",
    "phone": "Phone:",
    "email": "E-mail:",
    "website": "WebSite:",
    "general-information-title": "General remark",
    "general-information-1": "Based on Article 13 of the Swiss Federal Constitution and the data protection provisions of the Confederation (Data Protection Act, DSG), every person has the right to protection of their privacy and protection against misuse of their personal data. The operators of these pages take the protection of your personal data very seriously. We treat your personal data confidentially and in accordance with the statutory data protection regulations and this data protection declaration.",
    "general-information-2": "In cooperation with our hosting providers, we strive to protect the databases as well as possible from outside access, loss, misuse or counterfeiting.",
    "general-information-3": "We would like to point out that data transmission over the Internet (e.g. when communicating by email) can have security gaps. It is not possible to completely protect data from third-party access.",
    "general-information-4": "By using this website, you agree to the collection, processing and use of data as described below. This website can generally be visited without registration. Data such as pages viewed or the name of the file accessed, date and time are stored on the server for statistical purposes, without this data being directly related to you personally. Personal data, in particular name, address or email address, are collected on a voluntary basis as far as possible. Without your consent, the data will not be passed on to third parties.",
    "processing-personal-data-title": "Processing of personal data",
    "processing-personal-data-1": "Personal data is all information that relates to a specific or identifiable person. A data subject is a person who is used to process personal data. Editing includes all handling of personal data, regardless of the means and procedures used, in particular the storage, disclosure, procurement, deletion, storage, modification, destruction and use of personal data.",
    "processing-personal-data-2": "We process personal data in accordance with Swiss data protection law. For the rest, we process - insofar as and insofar as the EU GDPR is applicable - personal data in accordance with the following legal bases in connection with Art. 6 (1) GDPR",
    "processing-personal-data-2-li1": "lit. a) Processing of personal data with the consent of the data subject.",
    "processing-personal-data-2-li2": "lit. b) Processing of personal data to fulfill a contract with the data subject and to carry out corresponding pre-contractual measures.",
    "processing-personal-data-2-li3": "lit. c) Processing of personal data to fulfill a legal obligation, which we are subject to in accordance with any applicable EU law or in accordance with any applicable law of a country in which the GDPR is fully or partially applicable.",
    "processing-personal-data-2-li4": "lit. d) Processing of personal data in order to protect the vital interests of the data subject or another natural person.",
    "processing-personal-data-2-li5": "lit. f) Processing of personal data in order to protect the legitimate interests of us or third parties, provided that the fundamental freedoms and fundamental rights as well as the interests of the person concerned do not prevail. Legitimate interests are in particular our business interest in being able to provide our website, information security, the enforcement of our own legal claims and compliance with Swiss law.",
    "processing-personal-data-3": "We process personal data for the duration that is necessary for the respective purpose or purposes. In the case of longer-term storage obligations due to legal and other obligations to which we are subject, we restrict processing accordingly.",
    "cookies-title": "Privacy policy for cookies",
    "cookies-1": "This site uses cookies. These are small text files that make it possible to store specific, user-related information on the user's device while using the website. Cookies make it possible, in particular, to determine the frequency of use and number of users of the pages, to analyze behavior of the page usage, but also to make our offer more customer-friendly. Cookies remain stored at the end of a browser session and can be called up again when you visit the site again. If you do not want this, you should set your internet browser so that it refuses to accept cookies.",
    "cookies-2": "A general objection to the use of cookies used for online marketing purposes can be found on a large number of services, especially in the case of tracking, via the US website http://www.aboutads.info/choices/ or the EU website http://www.youronlinechoices.com/ be explained. Furthermore, cookies can be saved by switching them off in the browser settings. Please note that not all functions of this online offer can then be used.",
    "ssl-tls-encryption-title": "Data protection declaration for SSL / TLS encryption",
    "ssl-tls-encryption-1": "This website uses SSL / TLS encryption for security reasons and to protect the transmission of confidential content, such as inquiries that you send to us as the site operator. You can recognize an encrypted connection by the fact that the address line of the browser changes from 'http: //' to 'https: //' and by the lock symbol in your browser line.",
    "ssl-tls-encryption-2": "If SSL or TLS encryption is activated, the data that you transmit to us cannot be read by third parties.",
    "server-logs-title": "Data protection declaration for server log files",
    "server-logs-1": "The provider of this website automatically collects and stores information in so-called server log files, which your browser automatically transmits to us. These are:",
    "server-logs-1-li1": "Browser type and version",
    "server-logs-1-li2": "Operating system used",
    "server-logs-1-li3": "Referrer URL",
    "server-logs-1-li4": "Host name of the accessing computer",
    "server-logs-1-li5": "Time of the server request",
    "server-logs-2": "This data cannot be assigned to specific people. This data is not merged with other data sources. We reserve the right to check this data retrospectively if we become aware of specific indications of illegal use.",
    "contact-form-title": "Data protection declaration for contact form",
    "contact-form-1": "If you send us inquiries using the contact form, your details from the inquiry form, including the contact details you provided there, will be stored by us for the purpose of processing the inquiry and in the event of follow-up questions. We will not pass on this data without your consent.",
    "rights-data-subjects": {
      "title": "Rights of data subjects",
      "right-confirmation-title": "Right to confirmation",
      "right-confirmation-1": "Every data subject has the right to request confirmation from the operator of the website as to whether personal data relating to data subjects are processed. If you would like to exercise this right of confirmation, you can contact the data protection officer at any time.",
      "right-information-title": "Right to information",
      "right-information-1": "Any person with personal data affected by the processing has the right to receive free information from the operator of this website at any time about the personal data stored about him and a copy of this information. In addition, the following information can be provided if necessary:",
      "right-information-1-li1": "the processing purposes",
      "right-information-1-li2": "the categories of personal data that are processed",
      "right-information-1-li3": "the recipients to whom the personal data has been or will be disclosed",
      "right-information-1-li4": "if possible, the planned duration for which the personal data will be stored or, if this is not possible, the criteria for determining this duration",
      "right-information-1-li5": "the existence of a right to correction or deletion of the personal data concerning them or to restriction of processing by the person responsible or a right to object to this processing",
      "right-information-1-li6": "the right to lodge a complaint with a supervisory authority",
      "right-information-1-li7": "if the personal data is not collected from the data subject: all available information about the origin of the data",
      "right-information-2": "The data subject also has the right to information as to whether personal data has been transferred to a third country or to an international organization. If this is the case, the data subject also has the right to receive information about the appropriate guarantees in connection with the transfer.",
      "right-information-3": "If you would like to exercise this right to information, you can contact our data protection officer at any time.",
      "right-rectification-title": "Right to rectification",
      "right-rectification-1": "Any person affected by the processing of personal data has the right to request the immediate correction of incorrect personal data concerning them. Furthermore, the data subject has the right to request the completion of incomplete personal data, also by means of a supplementary statement, taking into account the purposes of the processing.",
      "right-rectification-2": "If you would like to exercise this right of correction, you can contact our data protection officer at any time.",
      "right-erasure-title": "Right to erasure (right to be forgotten)",
      "right-erasure-1": "Any person affected by the processing of personal data has the right to request the person responsible for this website to delete the personal data relating to them immediately, provided that one of the following reasons applies and if the processing is not necessary:",
      "right-erasure-1-li1": "The personal data were collected for such purposes or processed in any other way for which they are no longer necessary",
      "right-erasure-1-li2": "The data subject withdraws their consent on which the processing was based and there is no other legal basis for the processing",
      "right-erasure-1-li3": "The data subject objects to the processing for reasons that arise from their particular situation and there are no overriding legitimate reasons for the processing, or the data subject objects to the processing in the case of direct advertising and associated profiling",
      "right-erasure-1-li4": "The personal data was processed unlawfully",
      "right-erasure-1-li5": "The deletion of personal data is necessary to fulfill a legal obligation under Union law or the law of the member states to which the controller is subject",
      "right-erasure-1-li6": "The personal data was collected in relation to information society services offered that were made directly to a child",
      "right-erasure-2": "If one of the above reasons applies and you would like to have personal data stored by the operator of this website deleted, you can contact our data protection officer at any time. The data protection officer of this website will arrange for the request for deletion to be complied with immediately.",
      "right-restriction-processing-title": "Right to restriction of processing",
      "right-restriction-processing-1": "Any person affected by the processing of personal data has the right to request that the person responsible for this website restrict processing if one of the following conditions is met:",
      "right-restriction-processing-1-li1": "The data subject disputes the accuracy of the personal data for a period of time that enables the controller to check the accuracy of the personal data",
      "right-restriction-processing-1-li2": "The processing is unlawful, the data subject refuses to delete the personal data and instead requests that the use of the personal data be restricted",
      "right-restriction-processing-1-li3": "The controller no longer needs the personal data for the purposes of processing, but the data subject needs them to assert, exercise or defend legal claims",
      "right-restriction-processing-1-li4": "The data subject has objected to processing for reasons arising from their particular situation and it has not yet been determined whether the legitimate reasons of the controller outweigh those of the data subject",
      "right-restriction-processing-2": "If one of the above requirements is met, you would like to request the restriction of personal data stored by the operator of this website, you can contact our data protection officer at any time. The data protection officer of this website will arrange for the processing to be restricted.",
      "right-data-portability-title": "Right to data portability",
      "right-data-portability-1": "Every person affected by the processing of personal data has the right to receive the personal data concerning them in a structured, common and machine-readable format. It also has the right to have this data transferred to another person responsible if the legal requirements are met.",
      "right-data-portability-2": "Furthermore, the data subject has the right to have the personal data transferred directly from one responsible person to another responsible person, insofar as this is technically feasible and provided that this does not affect the rights and freedoms of other people.",
      "right-data-portability-3": "To assert the right to data portability, you can contact the data protection officer appointed by the operator of this website at any time.",
      "right-object-title": "Right to object",
      "right-object-1": "Any person affected by the processing of personal data has the right to object to the processing of personal data relating to them at any time for reasons arising from their particular situation.",
      "right-object-2": "The operator of this website no longer processes the personal data in the event of an objection, unless we can demonstrate compelling legitimate grounds for the processing that outweigh the interests, rights and freedoms of the data subject, or if the processing of the assertion, exercise or Defense of legal claims.",
      "right-object-3": "To exercise the right to object, you can contact the data protection officer of this website directly.",
      "right-withdraw-consent-under-data-protection-law-title": "Right to withdraw consent under data protection law",
      "right-withdraw-consent-under-data-protection-law-1": "Any person affected by the processing of personal data has the right to revoke their consent to the processing of personal data at any time.",
      "right-withdraw-consent-under-data-protection-law-2": "If you would like to exercise your right to withdraw consent, you can contact our data protection officer at any time."
    },
    "copyrights-title": "Copyrights",
    "copyrights-1": "The copyrights and all other rights to content, images, photos or other files on the website belong exclusively to the operator of this website or the specifically named rights holders. The written consent of the copyright holder must be obtained in advance for the reproduction of all files.",
    "copyrights-2": "Anyone who commits a copyright infringement without the consent of the respective rights holder can be punished and, if necessary, liable to pay damages.",
    "general-disclaimer-title": "General disclaimer",
    "general-disclaimer-1": "All information on this website has been carefully checked. We strive to offer our information in a current, correct and complete manner. Nevertheless, the occurrence of errors cannot be completely ruled out, which means that we cannot guarantee the completeness, accuracy and timeliness of information, including journalistic and editorial information. Liability claims arising from material or immaterial damage caused by the use of the information offered are excluded, unless there is evidence of willful or grossly negligent fault.",
    "general-disclaimer-2": "The publisher can change or delete texts at his own discretion and without notice and is not obliged to update the content of this website. Use or access to this website is at the visitor's own risk. The publisher, his clients or partners are not responsible for damage, such as direct, indirect, accidental, to be determined in advance or consequential damage, which allegedly resulted from visiting this website and therefore accept no liability for this.",
    "general-disclaimer-3": "The publisher also assumes no responsibility and liability for the content and availability of third-party websites that can be reached via external links on this website. The operators of the linked pages are solely responsible for their content. The publisher thus expressly distances himself from all third-party content that may be relevant under criminal law or liability law or that violates common decency.",
    "modifications-title": "Modification",
    "modifications-1": "We can change this privacy policy at any time without notice. The current version published on our website applies. Insofar as the data protection declaration is part of an agreement with you, we will inform you of the change by email or in another suitable way in the event of an update.",
    "questions-data-protection-officer-title": "Questions to the data protection officer",
    "questions-data-protection-officer-1": "If you have any questions about data protection, please send us an email or contact the person responsible for data protection at the beginning of the data protection declaration.",
    "last-changed-date": "17.06.2020",
    "source-title": "Source:",
    "source": "SwissAnwalt"
  }
}
